using System;

namespace ConsoleApplication
{
    public class Program
    {
        //Выведите двумерный массив, размерами N×N, заполненный числами от единицы до N*N по спирали. 
        //Числовая спираль начинается в левом верхнем углу и закручивается по часовой стрелке.
        //Входные данные 
        //Входной файл содержит единственное число 1 ≤ N ≤ 10.

        //Выходные данные 
        //Выведите N2 чисел – заполненный по спирали массив.

        //Примеры
        //Входные данные
        //1
        //Выходные данные
        //1

        //Входные данные
        //2
        //Выходные данные
        //1 2         
        //4 3

        //Входные данные
        //3
        //Выходные данные
        //1 2 3 
        //8 9 4 
        //7 6 5
          
        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
