using System;

namespace ConsoleApplication
{
    public class Program
    {

        //Напишите класс Home, представляющий дом
        //Класс должен иметь автосвойста:
        //Адрес
        //Массив проживающих в нем людей(из задания ранее)
        //Жилая площадь
        

        //Класс так же должен иметь свойство, которое позваляе получить
        //количество проживающих людей

        //Класс должен иметь метод 
        //double CalculatePriceForMonth(double forOneMeter)
        //Метод должен возвращать цену за отопление за месяц, которая рассчитывается по формуле:
        //Плата = отапливаемая площадь * цена за один кв метр
        //Второй множитель передается как аргумент метода 

         //В методе Main создайте несколько домов, и проверьте работоспособность класса
        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
