using System;

namespace ConsoleApplication
{
    public class Program
    {
        // Задача 11 исключающее или
        
        //Напишите функцию 
        //static bool Xor (bool x, bool y) 
        //реализующую функцию "Исключающее ИЛИ" двух логических переменных x и y. 
        //Функция Xor должна возвращать true, если ровно один из ее аргументов x или y, но не оба одновременно равны true.
        //Фунция не должна использовать конструкцию if

        //Напишите функцию 
        //static bool XorIf (bool x, bool y) 
        //реализующую функцию "Исключающее ИЛИ" двух логических переменных x и y. 
        //Функция Xor должна возвращать true, если ровно один из ее аргументов x или y, но не оба одновременно равны true.
        //Фунция должна использовать конструкцию if
        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
