using System;

namespace ConsoleApplication
{
    public class Program
    {
        
        //Задача 9 про соседние элементы


		//Входные данные
		//Сначала задано число N — количество элементов в массиве (1N100 ). Далее через пробел записаны N чисел — элементы массива. Массив состоит из целых чисел.

		//Выходные данные
		//Необходимо вывести количество элементов массива, у которых два соседа и которые при этом строго больше обоих своих соседей.

		//Примеры
		//входные данные
		//5
		//1 2 3	4 5
		//
		//выходные данные
		//0
		//входные данные
		//5
		//1 5 1 5 1

		//выходные данные
		//2
		public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
		