using System;

namespace ConsoleApplication
{
    public class Program
    {
        // Задача 13 про последовательность фибоначчи

        //Последовательность Фибоначчи определена следующим образом: φ(0)=1, φ(1)=1, φ(n)=φ(n-1)+φ(n-2) при n>1. 
        //Начало ряда Фибоначчи выглядит следующим образом: 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, ... 
        //Напишите функцию int Phi(int n), которая по данному натуральному n возвращает φn.

        //Пример
        //при выполнении
        //int result = Phi(3);

        //result должно хранить 3

        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
