using System;

namespace ConsoleApplication
{
    public class Program
    { 
    	//Задача 3, максимальное число 
    	//Даны два целых числа, каждое число записано в отдельной строке.
    	//Необходимо вывести максимальное число из введенных

    	//Пример
    	//Выходные
    	//1
    	//2

    	//Выходные
    	//2
        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
