using System;

namespace ConsoleApplication
{
    public class Program
    {
    	//(double)?

    	//Задача 8 про спортсмена

    	//В первый день спортсмен пробежал x километров
    	//а затем он каждый день увеличивал пробег на 10% от предыдущего значения
    	//По данному числу y определите номер дня, на который пробег спортсмена составит не менее y километров.

		//Входные данные
		//Программа получает на вход действительные числа x и y

		//Выходные данные
		//Программа должна вывести одно натуральное число.

		//Примеры
		//входные данные
		//10
		//20

		//выходные данные
		//9
        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
