using System;

namespace ConsoleApplication
{
    public class Program
    {
        // Задача 12 про голосование

        //Написать метод Vote 
        //который принимает в сбя неограниченное количество параметров типа bool
        //возвращать метод должен значение bool
        //метод возвращает true, если в переданных параметрах больше true, чем false
        //иначе - возвращает false

        //Если небыло переданно параметров, метод должен вернуть false

        //Например, если вызвать 
        //bool result = Vote(true, true, false);

        //result должно хранить true

        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
