using System;

namespace ConsoleApplication
{
    public class Program
    {
        // Задача 10 минимум четырех

        //Напишите функцию 
        //static int min (int a, int b, int c, int d) 
        //находящую наименьшее из четырех данных чисел.

        public static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
